Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ངས་ནི་སེམས་ཅན་བྱེ་བ་དུ་མ་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་ཤེས་ཀྱིས།
en: Nevertheless, noble son, I do know of many millions of beings who have gone beyond suffering by means of the vehicle of the hearers and the vehicle of the solitary buddhas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེའི་ཕྱིར་བརྩོན་འགྲུས་ཟློག་ཤིག
en: Therefore, noble son, relinquish your diligence!

source: དོན་མེད་པར་ཉོན་མོངས་པ་ལ་སྟེན་པ་པོར་གྱུར་ཏ་རེ་ཞེས་
en: I swear that you will otherwise just cause trouble for yourself for no reason at all.’

source: དད་པ་དང་བྲལ་བར་བྱེད་ཅིང་ཀྱལ་ཀ་བྱེད་ཀྱང་། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Yet when faced with such efforts to make them lose faith and to ridicule them, bodhisattvas will think,

source: ཀྱེ་མ་འདི་ནི་བདུད་སྡིག་ཅན་བདག་ལ་ཀྱལ་ཀ་བྱེད་པར་འདོད་དོ་
en: ‘Alas, these are Pāpīyān’s attempts to ridicule me.’

source: སྙམ་སྟེ། དེས་དེ་ལྟར་ཤེས་ནས་བདུད་སྡིག་ཅན་དེ་ལ་འདི་སྐད་དུ།
en: With that in mind bodhisattvas will reply,

source: སྡིག་ཅན་ཁྱོད་བྱ་བ་ཉུང་ངུ་གྱིས་ཤིག
en: ‘Pāpīyān, you ought to cut down on your work.

source: འཇིག་རྟེན་གྱི་སྐོ་ཤམ་གྱིས་ཁྱོད་ལ་ཅི་ཞིག་བྱ།
en: Why do you bother so much about worldly affairs?

source: སྡིག་ཅན་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ལས་བདག་གིར་བྱ་བ་ནི་འཇིག་རྟེན་པ་ཡིན་ཏེ།
en: Pāpīyān, the Blessed One has taught, “Mundane beings are engaged in the appropriation of karmic action.

source: ལས་ཀྱི་བགོ་སྐལ་ལ་སྤྱོད་པའོ། །ལས་ཀྱི་སྐྱེ་གནས་པའོ། །ལས་ལ་རྟོན་པའོ་ཞེས་གསུངས་ཏེ།
en: Thus, they experience their own share of karma, they remain in the world of karma, and they are upheld by karma.”

source: སྡིག་ཅན་ཁྱོད་ཀྱང་ལས་བདག་གིར་བྱ་བ་ཡིན་ཏེ།
en: Pāpīyān, you also appropriate karmic action.

source: ལས་ཀྱི་བགོ་སྐལ་ལ་སྤྱོད་པ། ལས་ཀྱི་སྐྱེ་གནས་པ། ལས་ལ་རྟོན་པ་ཡིན་གྱིས།
en: You experience your own share of karma. Living in the world of karma, you are upheld by karma.

source: སྡིག་ཅན་ཁྱོད་གང་ནས། འོངས་པའི་ལམ་ནས་སོང་ཤིག
en: Pāpīyān, now leave on the same path that brought you here!

source: ང་ལ་ཀྱལ་ཀ་བྱས་པས་ཁྱོད་ཡུན་རིང་པོར་དོན་མེད་པ་དང་། གནོད་པ་དང་། སྡུག་བསྔལ་བར་གྱུར་ཏ་རེ་ཞེས་བསྒོའོ།
en: I can assure you that your efforts to ridicule me will make you feel useless, hurt, and in pain for a long time.’

source: བདུད་སྡིག་ཅན་དེ་ཡང་བདག་གི་སེམས་ནི་སེམས་ཀྱིས་ཚོར་བར་རིག་ནས་ཡིབས་ཡིབས་ཏེ་དེ་ཉིད་དུ་མི་སྣང་བར་འགྱུར་རོ།
en: Understanding how his own mind is governed by feelings, the demon Pāpīyān will then immediately hide and disappear.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཐམས་ཅད་དམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་ཐམས་ཅད་ཀྱིས་ཀྱལ་ཀ་བྱས་ཏེ་
en: Thus the ridicule of all the māras and demonic gods

source: དད་པ་དང་དབྲལ་བར་བྱས་ཀྱང་མི་འགྱུར།
en: will never make bodhisattvas lose faith.

source: མི་འཇུམ། ཞུམ་པར་མི་འགྱུར་ཏེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེ་ལྟ་བུའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: Never will they shudder or lose heart. Such is the bodhisattvas’ vajra-like diligence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་འཕྲོགས་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ inalienable diligence consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པའི་རྣམ་པ་ཇི་ལྟ་བུས་
en: The qualities of a bodhisattva who engages in this diligence

source: གྲངས་སུ་ཡང་ཉེ་བར་མི་འགྲོ། ཆ་དང་། བགྲང་བ་དང་། དཔེ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོ་
en: unmatched in terms of any fraction, number, quantity, analogy, or likeness

source: ཡུན་རིང་པོ་ནས་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ཀྱང་
en: —even by other bodhisattvas who have long practiced that vehicle,

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལྟ་ཅི་སྨོས་ཏེ།
en: so it goes without saying that hearers and solitary buddhas do not possess such diligence.

source: དེའི་སེམས་འབྱུང་བ་རེ་རེ་ལ་བརྩོན་འགྲུས་ཀྱི་སྟོབས་བསྐྱེད་པས།
en: Bodhisattvas who possess this diligence create the power of diligence within each mind state.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཅིང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྤོང་བ་དེ་ལྟ་བུའི་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: Thus they muster a diligence that upholds all the qualities of the Buddha and gives up all negative and unvirtuous qualities.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་འཕྲོགས་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: Such are the bodhisattvas who possess inalienable diligence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་གཉིས་དང་བྲལ་བའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ diligence free of the two extremes consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཧ་ཅང་བརྟུན་ངས་པའམ། ཧ་ཅང་ཞན་པའི་བརྩོན་འགྲུས་མི་རྩོམ་སྟེ།
en: The diligence mustered by bodhisattvas is neither overly assiduous nor too weak.

source: ཧ་ཅང་བརྟུན་ངས་པའི་བརྩོན་འགྲུས་ནི་ཡབ་ཡབ་པོར་འགྱུར།
en: were it too assiduous they would become stressed,

source: ཧ་ཅང་ཞན་པ་ནི་ལེ་ལོར་འགྱུར་ཏེ།
en: were it too weak they would become lazy.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་གཉིས་དང་བྲལ་བའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: Such is the bodhisattvas’ diligence free of the two extremes.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རླབས་པོ་ཆེའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ vast diligence consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་བརྩོན་འགྲུས་རྩོམ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ཅི་འདྲ་བར་བདག་གི་ལུས་ཀྱང་དེ་དང་འདྲ་བར་འགྱུར།
en: Here bodhisattvas arouse diligence with a wish that their own body might become just like the body of the Thus-Gone One.

source: ཡང་བདག་ལ་ཡོད་པར་འགྱུར་རོ།
en: They wish to become just like

source: གང་དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་བལྟར་མི་སྣང་བ་དང་།
en: the thus-gone ones whether with respect to the crown of his head being invisible,

source: འོད་འདོམ་གང་བ་དང་།
en: his fathom-wide aura,

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཕུན་སུམ་ཚོགས་པ་དང་།
en: his perfect major and minor marks,

source: ཡེ་ཤེས་ཐོགས་པ་མེད་ཅིང་མཐའ་ཡས་པ་དང་།
en: his unimpeded and infinite wisdom,

source: སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་དང་།
en: the magnificence of a buddha,

source: སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་ཉིད་དེ་
en: a buddha being the supreme head of the herd.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རླབས་པོ་ཆེའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: Such is the bodhisattvas’ vast diligence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འབར་བའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ blazing diligence consist in?

source: དཔེར་ན་གསེར་རམ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་དང་སྐྱོན་ཐམས་ཅད་དང་བྲལ་བ་ནི་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེ་སྟེ།
en: when gold or a precious jewel is stainless and free of any flaws it is brilliant, bright, and radiant.

source: དེ་ནི་ཨ་ལ་ལ་འབར་བའི་གསེར་རོ། །ཨ་ལ་ལ་འབར་བའི་ནོར་བུ་རིན་པོ་ཆེ་ཞེས་བྱའོ།
en: It may then be spoken of as ‘gold blazing with splendor’ or ‘a jewel blazing with splendor.’

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱང་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ཐམས་ཅད་དང་བྲལ་བ་ཡིན་ནོ།
en: Similarly, the diligence of bodhisattvas is also stainless and free of all flaws.

source: བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་དེ་དག་གང་ཞེ་ན།
en: What are the stains and flaws related to diligence?

source: ལེ་ལོ་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ནོ།
en: Laziness is a stain and a flaw in relation to diligence.

source: སྙོམ་ལས་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ནོ།
en: Indolence is a stain and a flaw in relation to diligence.

source: ཟས་ལ་ཚོད་མི་ཤེས་པ་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ནོ།
en: Overeating is a stain and a flaw in relation to diligence.

source: བདག་མི་ཤེས་པ་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ནོ།
en: Not understanding oneself is a stain and a flaw in relation to diligence.

source: ཚུལ་མ་ཡིན་པ་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ནོ།
en: Inappropriateness is a stain and a flaw in relation to diligence.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ནོ།
en: Incorrectness is a stain and a flaw in relation to diligence.

source: འདུ་འཛི་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་སྐྱོན་ཏེ།
en: Social activity is a stain and a flaw in relation to diligence.

source: དེ་དག་ནི་བརྩོན་འགྲུས་ཀྱི་དྲི་མ་དང་། བརྩོན་འགྲུས་ཀྱི་སྐྱོན་ཞེས་བྱའོ།
en: These are all stains and flaws in relation to diligence,

source: དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་མེད་པ་ཡིན་ཏེ།
en: bodhisattvas are free of all those.

source: དེའི་ཕྱིར་དེའི་བརྩོན་འགྲུས་དེ་འབར་ཞིང་དྲི་མ་མེད་པ་དང་། འོད་གསལ་ཞིང་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་བྱང་བ་ཡིན་ནོ།
en: Hence their diligence is blazing and stainless, luminous and pure, and perfectly purified.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འབར་བའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: Such is the bodhisattvas’ blazing diligence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྒྱུན་དུ་ཆུད་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ continuous diligence consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་ལམ་ཐམས་ཅད་དུ་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: Bodhisattvas are diligent throughout all their activities.

source: ཅི་ནས་ཀྱང་ལུས་སྐྱོ་བར་མི་འགྱུར་བ་དང་། སེམས་སྐྱོ་བར་མི་འགྱུར་བ་དེ་ལྟར་བརྩོན་པ་དེ་ནི་
en: Never do they tire physically, nor do they experience any weariness of the mind.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་རྒྱུན་དུ་ཆུད་པ་ཞེས་བྱ་སྟེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྒྱུན་དུ་ཆུད་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: That is called the bodhisattvas’ continuous diligence and in this way bodhisattvas have continuous diligence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་དག་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ pure diligence consist in?

source: དེ་ལྟར་རྒྱུན་དུ་ཆུད་པའི་བརྩོན་འགྲུས་ཅན་དེའི་གང་སྡིག་པ་མི་དགེ་བའི་ཆོས་བྱང་ཆུབ་ཀྱི་ལམ་གྱི་བར་དུ་གཅོད་པ་གནོད་པ་དང་ལྡན་པ་དེ་དག་སྤངས་པ་ཡིན།
en: Bodhisattvas who possess continuous diligence will give up all harmful, negative, and unvirtuous factors that present obstacles to the path of awakening.

source: གང་ཡང་འདི་དག་དགེ་བའི་ཆོས་མྱ་ངན་ལས་འདས་པ་དང་འཐུན་པ། བྱང་ཆུབ་ཀྱི་ལམ་གྱི་ཚོགས་དང་འཐུན་པ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་བྱང་ཆུབ་ཏུ་འབྲང་བ་དེ་དག་འཕེལ་བ་དང་། རྒྱས་པ་དང་། ཡངས་པར་འགྱུར་ཏེ།
en: they will increase, enrich, and expand those virtuous factors that are conducive to the transcendence of suffering, the accumulations on the path of awakening, and the perfection of the aspects of awakening.

source: དེ་ལ་མི་དགེ་བའི་སེམས་སྐྱེ་བ་ཕྲ་ཞིང་ཆུང་བ་འགའ་ཡང་མི་སྐྱེ་ན་ཆེ་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: Since not even subtle or minute unvirtuous mind states arise, it goes without saying that the coarse ones do not occur either.

source: དེ་ནི་རྣམ་པར་དག་པའི་བརྩོན་འགྲུས་ཞེས་བྱ་བ་སྟེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་དག་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: This is referred to as pure diligence, and in this way bodhisattvas have pure diligence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐུན་མོང་མ་ཡིན་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ extraordinary diligence consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Bodhisattvas think as follows:

source: གལ་ཏེ་ཕྱོགས་བཅུ་ཀུན་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཅིག་མན་ར་མེད་པའི་མེའི་ཕུང་པོ་ཆེན་པོས་བྱུར་བུར་གང་བར་གྱུར་ལ།
en: ‘Even if as many worlds throughout the ten directions as there are grains of sand in the river Gaṅgā became engulfed by the great flames of the Hell of Incessant Pain,

source: སེམས་ཅན་གཅིག་ཅིག་སྡུག་བསྔལ་ཞིང་། སྐྱབས་མེད། མགོན་མེད་དེ། གནས་དང་། རྟེན་མེད་པ་ཞིག་ཡོད་ནའང་སེམས་ཅན་གཅིག་པོ་དེའི་དོན་གྱི་ཕྱིར་མེའི་ཕུང་པོ་དེ་ལ་རྐང་གིས་འབོགས་ཏེ།
en: I would walk through that mass of fire to save just a single being who suffers and who is in need of protection, a guard, shelter, or support.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་འདས་ནས་སེམས་ཅན་གཅིག་པོ་དེ་ཐར་བར་བྱ་བར་བདག་སྤྲོ་ན་
en: Since I would cross that many worlds just to free a single being,

source: སྡུག་བསྔལ་ཕལ་ལྟ་ཅི་ཞིག་སྨོས་སྙམ་སྟེ།
en: I would of course also bear with ordinary types of suffering.’

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། མུ་སྟེགས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པ་ཞེས་བྱ་སྟེ།
en: Such diligence is said to be unshared by any hearer, solitary buddha, or non-Buddhist.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐུན་མོང་མ་ཡིན་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: It is therefore the bodhisattvas’ extraordinary diligence.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་བརྙས་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ diligence that does not deprecate consist in?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་མིར་གྱུར་པས་ནི་བྱང་ཆུབ་ཐོབ་པར་དཀའ་སྟེ།
en: In this regard, a bodhisattva will never think, ‘Awakening is hard to reach for a human being.

source: བདག་གི་བརྩོན་འགྲུས་འདི་ནི་ཆུང་ཤིང་ཞན་ལ་བདག་ཀྱང་ལེ་ལོ་ཅན་ཏེ།
en: My own diligence is little and weak; I am a lazy person.

source: བྱང་ཆུབ་ནི་མགོའི་ཐོད་ལ་མེ་འབར་བ་བཞིན་དུ་བསྐལ་པ་མང་པོ་བསྐལ་པ་བརྒྱ་ཕྲག་མང་པོ། བསྐལ་པ་སྟོང་ཕྲག་མང་པོ། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བསྒྲུབ་
en: Awakening, on the other hand, is something that one accomplishes over many hundreds, thousands, or hundreds of thousands of eons while practicing as if one’s head were on fire.

source: དགོས་པས་བདག་ནི་དེ་ལྟ་བུའི་ཁུར་བསྐུར་བར་མི་སྤྲོའོ་སྙམ་དུ་སེམས་མི་སྐྱེད་དེ།
en: I don’t feel like taking that sort of obligation upon myself.’

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་དག་དང་། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་དག་དང་། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་
en: ‘When the thus-gone, worthy, perfect buddhas fully awakened to unexcelled and complete buddhahood in the past, when they fully awaken now, and when they fully awaken in the future,

source: དེ་དག་ཀྱང་ཚུལ་འདི་དང་འདྲ་བ་དང་། ལམ་འདི་དང་འདྲ་བ་དང་། བརྩོན་འགྲུས་འདི་དང་འདྲ་བས་
en: it is always in this sort of way, by this sort of path, and through this sort of diligence.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: This is how the thus-gone ones have fully awakened to unexcelled and complete buddhahood in the past, this is how they do so now, and this is how they will awaken in the future.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པར་གྱུར་པ་ཤ་སྟག་ལས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མ་ཡིན་གྱི།
en: And all of them are thus-gone ones—there is no one among them who fully awakened in any other way.

source: བདག་ཅི་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་
en: Therefore, I too must by all means also fully awaken to unexcelled and complete buddhahood.

source: སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་གི་བརྩོན་འགྲུས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་དམིགས་པའི་བརྩོན་འགྲུས་ཀྱིས་བདག་གིས་ཀྱང་དེ་ལྟ་དེ་ལྟར་བཙལ་ལོ་འབད་དོ།
en: I shall therefore endeavor in exactly that way by means of a diligence that extends to and focuses on all sentient beings.

source: བདག་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བརྩོན་པ་ལ་ནི་སེམས་ཅན་དམྱལ་བ་ན་གནས་ཀྱང་
en: As I exert myself to benefit all beings, I may well remain in hell.

source: བླའི་བདག་ལ་ཕན་པར་བརྩོན་ན་མྱ་ངན་ལས་འདས་པ་ནི་མ་ཡིན་ནོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: My diligence is indeed not directed at the transcendence of suffering!’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་བརྙས་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: Such is the bodhisattvas’ diligence that does not deprecate.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙེམས་པ་མེད་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ཞེ་ན།
en: “Noble son, you may also wonder about the character of the bodhisattvas’ diligence that is free of conceit.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་རྩོམ་ན་བརྩོན་འགྲུས་དེའི་རོ་མྱོང་བར་མི་བྱེད་དེ།
en: When bodhisattvas practice diligence they do not relish the taste of diligence.

source: བརྩོན་འགྲུས་དེས་གཞན་ལ་མི་སྨོད། བདག་ལ་མི་སྟོད་དེ།
en: Their diligence does not make them disparage others, nor does it cause any self-aggrandizement.

source: དེ་འདི་སྙམ་དུ་ཤེས་རབ་དང་ལྡན་པའི་རང་བཞིན་ཅན་སུ་ཞིག་བདག་གི་ལས་ལ་བརྩོན་པས་གཞན་ལ་སྨོད་སྙམ་དུ་སེམས་ཏེ།
en: Rather, bodhisattvas think, ‘What sort of insightful person would make their own diligent activity the grounds for looking down on others?’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྙེམས་པ་མེད་པའི་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: Noble son, such is the bodhisattvas’ diligence free of conceit.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities are endowed with excellent diligence.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who practice excellent concentration possess ten qualities.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བསོད་ནམས་ཀྱིས་བརྟན་པ་རྣམས་ཡིན། སྐྱོ་བ་མང་བ་རྣམས་ཡིན། བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཡིན། མང་དུ་ཐོས་པ་རྣམས་ཡིན། མ་ལོག་པར་གདམས་ངག་བསྒོམ་པ་ལ་བརྩོན་པ་རྣམས་ཡིན། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་ཞུགས་པ་རྣམས་ཡིན། དབང་པོ་རྣོ་བ་རྣམས་ཡིན། སེམས་ལ་མཁས་པ་རྣམས་ཡིན། ཞི་གནས་དང་། ལྷག་མཐོང་ལ་མཁས་པ་རྣམས་ཡིན། དེ་ལ་མ་ཞེན་པ་རྣམས་ཡིན་ནོ། །
en: What are those ten? They are steadfastness through merit, strong weariness, engendering diligence, great learning, perseverance in the unmistaken application of the instructions, adopting the qualities that accord with the Dharma, sharp faculties, expertise with regard to the mind, skill in tranquility and special insight, and non-attachment.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱིས་བརྟན་པ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder about the character of the bodhisattvas’ steadfastness through merit.

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ཆེན་པོ་ལ་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་བསགས་ཤིང་
en: Bodhisattvas gather numerous roots of virtue within the Great Vehicle,

source: ཚེ་རབས་ཐ་དད་པ་དེ་དང་དེ་དག་ཏུ་སྤྱད་པ་ལེགས་པར་སྤྱད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ་ཡིན་ཏེ།
en: throughout their succession of different lives bodhisattvas practice well and are cared for by spiritual teachers.

source: དེ་བྲམ་ཟེའི་རིགས་ཤིང་ས་ལ་ཆེན་པོ་ལྟ་བུའམ། རྒྱལ་རིགས་ཤིང་ས་ལ་ཆེན་པོ་ལྟ་བུའམ། ཁྱིམ་བདག་གི་རིགས་ཤིང་ས་ལ་ཆེན་པོ་ལྟ་བུ་གང་དང་གང་དུ་སྐྱེས་ཀྱང་ཁྱིམ་དེའི་མི་དད་པ་ཡིན་ཏེ།
en: Thus, wherever they may take birth among brahmin families like great sāla trees, royal families like great sāla trees, or householder families like great sāla trees, the people of their household will be faithful.

source: དེ་སྐྱེས་ནས་ཀྱང་རྒྱུ་དེ་དག་དང་རྐྱེན་དེ་དག་དེ་བས་ཀྱང་འཕེལ་ཞིང་རྒྱས་པ་དང་ཡངས་པར་འགྱུར་ཏེ།
en: Moreover, by the causes and conditions of the bodhisattvas’ birth there, their faith will develop, grow, and expand further still.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་དང་མི་འབྲལ་བ་ཡིན་ཏེ།
en: Bodhisattvas do not separate from their spiritual teachers.

source: དགེ་བའི་བཤེས་གཉེན་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: Who are their spiritual teachers?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་གམ། བྱང་ཆུབ་སེམས་དཔའ་དག་གོ།
en: They are blessed buddhas or bodhisattvas.

source: དེ་སྐྱེས་ན་སྔོན་དགེ་བའི་རྩ་བ་ལ་གོམས་པས་འདི་ལྟར་དཔྱོད་དེ།
en: “When bodhisattvas take birth, due to the power of their affinity with past roots of virtue, they think,

source: ཀྱེ་མ་སྐྱེ་དགུ་འདི་ནི་སྡུག་བསྔལ་བའོ།
en: ‘Alas, these beings are suffering!

source: ཀྱེ་མ་སྐྱེ་དགུ་འདི་ནི་ཉམ་ཐག་པའོ།
en: Alas, these beings are helpless!

source: ཀྱེ་མ་སྐྱེ་དགུ་འདི་ནི་ན་བའོ།
en: Alas, these beings are suffering from disease!

source: ཀྱེ་མ་སྐྱེ་དགུ་འདི་ནི་མི་གནས་པའོ།
en: Alas, these beings have no rest!

source: ཀྱེ་མ་སྐྱེ་དགུ་འདི་ནི་ཡུན་རིང་པོ་ནས་ནད་པར་གྱུར་པའོ།
en: Alas, these beings have been sick for a long time!

source: ཀྱེ་མ་སྐྱེ་དགུ་འདི་ནི་གཏི་མུག་གིས་ལྡོངས་པའོ།
en: Alas, these beings are blinded by ignorance!

source: དེའང་འདོད་པའི་རྒྱུ་དང་འདོད་པའི་ཕྱིར་ཏེ།
en: And all that is caused by desire; all that is due to desire.

source: དེ་བས་ན་འཇིག་རྟེན་གནས་པ་དེ་ལྟ་བུ་ལ་བདག་གིས་འདོད་པ་རྣམས་ལ་བསྟེན་པ་ནི་བདག་གི་མི་ཆའི།
en: Therefore, were I also to indulge in desire in the way that worldly beings do, that would not be becoming.

source: འདོད་པ་ཞེས་བྱ་བ་འདི་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཡོངས་སུ་བརྟགས་པ་སྟེ།
en: So-called “desire” can be understood to be imperfect.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་རྣམ་གྲངས་དུ་མར་འདོད་པ་རྣམས་ཀྱི་ཉེས་པ་འདི་ལྟ་སྟེ།
en: Hence also the Blessed One has repeatedly taught about the shortcomings of desire.

source: འདོད་པ་རྣམས་ནི་གསལ་ཤིང་ལྟ་བུའོ། །འདོད་པ་རྣམས་ནི་མཚོན་ཤག་ཏི་ལྟ་བུའོ། །འདོད་པ་རྣམས་ནི་རལ་གྲིའི་སོ་ལྟ་བུའོ། །འདོད་པ་རྣམས་ནི་སྤུ་གྲིའི་སོ་ལྟ་བུའོ། །འདོད་པ་རྣམས་ནི་སྦྲུལ་གྱི་མགོ་ལྟ་བུའོ། །འདོད་པ་རྣམས་ནི་དབུ་བ་རྡོས་པ་ལྟ་བུའོ། །འདོད་པ་རྣམས་ནི་རུལ་པའོ། །འདོད་པ་རྣམས་ནི་དྲི་ང་བའོ་ཞེས་གསུངས་སོ་
en: He says, “Desires are like poles for impalement! Desires are like pikes! Desires are like the edge of a sword! Desires are like the edge of a razor! Desires are like a snake’s head! Desires are like bursting bubbles! Desires are rot! Desires stink!”

source: དེ་དེ་ལྟར་སྐྱོ་ནས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ། གོས་ངུར་སྨྲིག་དག་བགོས་ནས།
en: “Therefore, as they become weary in these ways they shave off their hair and beard, donning the saffron-colored robes.

source: དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་ཡང་དག་པར་རབ་ཏུ་འབྱུང་ངོ་།
en: Thus, joyfully leaving home to become homeless, they take ordination.

source: དེ་རབ་ཏུ་བྱུང་ནས་མ་ཐོབ་པ་འཐོབ་པར་བྱ་བ་དང་། ཁོང་དུ་མ་ཆུད་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། མངོན་དུ་མ་བྱས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་ནོ།
en: As monastics, they muster diligence to attain what had not been attained, comprehend what had not been comprehended, and actualize what had not been actualized.

source: དེ་དེའི་རྒྱུ་དེ་དེའི་རྐྱེན་དེའི་གཞིས་ཀུན་རྫོབ་ཀྱི་བདེན་པའི་ཚུལ་དུ་བཤད་པ་དང་། དོན་དམ་པའི་བདེན་པའི་ཚུལ་དུ་བཤད་པའི་ཐོས་པ་འཛིན་ཏོ།
en: Through such causes, conditions, and bases they retain the teachings that they receive with regard to the relative and ultimate truths.

source: དེ་གཉིས་ཀ་ལ་ཡང་མཁས་པས་གདམས་ངག་ཡང་དག་པར་བསྒོམ་མོ།
en: Becoming expert with respect to both truths, they train genuinely in the application of the oral instructions.

source: གདམས་ངག་མ་ལོག་པར་བསྒོམ་པ་ལ་བརྩོན་པས་ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་འཇུག་སྟེ།
en: Diligently training in the instructions without error, they adopt the qualities that accord with the Dharma.

source: ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་དེའང་གང་ཞེ་ན།
en: “What are the qualities that accord with the Dharma?

source: འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: They are authentic view, thought, speech, activity, livelihood, effort, mindfulness, and absorption.

source: དེས་ལམ་ཁོང་དུ་ཆུད་པས་དབང་པོ་རྣོ་བ་དང་། དབང་པོ་གསལ་བ་དང་། དེ་ཤེས་པའི་དབང་པོ་ཅན་ཡིན་ནོ།
en: Since the path is comprehended by means of these, they obtain faculties that are sharp, clear, and aware of the path.

source: དེ་དབང་པོ་རྣོ་ཞིང་དབང་པོ་གསལ་ལ་དེ་ཤེས་པའི་དབང་པོ་ཅན་ཡིན་པས་དབེན་པ་མང་བ་ཡིན་ཏེ།
en: With faculties that are sharp, clear, and aware, they enjoy abundant solitude.

source: དེ་འདུ་བ་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་ངོ་། འདུ་འཛི་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་ངོ་།
en: They abandon all gatherings and abandon all busyness.

source: སྨྲ་བ་ལ་དགའ་བ་དང་། འདོད་པའི་རྣམ་པར་རྟོག་པ་དང་། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་། འཚེ་བའི་རྣམ་པར་རྟོག་པ་དང་། ལྷ་ལ་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་ངོ་།
en: They no longer feel any pleasure in talking, and give up thoughts of craving, ill will, and malice, and thoughts about gods.

source: ཤེས་ཀྱི་ཁེ་འདོད་པ་དང་། གྲགས་པ་འདོད་པ་དང་། རྙེད་པ་འདོད་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་སྟེ།
en: They completely lose interest in gain, fame, and acquisitions.

source: དེ་ལུས་དང་སེམས་རབ་ཏུ་དབེན་པས་སེམས་ལ་མཁས་པ་ཡིན་ཏེ།
en: By means of physical and mental disengagement they gain expertise with respect to the mind.

source: དེ་སེམས་ལ་འདི་སྙམ་དུ་བདག་གིས་སེམས་འདི་ཅི་དགེ་བ་ལ་སྤྱོད་དམ། དེ་སྟེ་མི་དགེ་བའམ། འོན་ཏམ་ལུང་དུ་མ་བསྟན་པའམ།
en: Thus they will examine as follows: ‘Is my mind involved in something virtuous, or something unvirtuous, or something neutral?

source: ཆོས་གང་ལ་སྤྱོད་ཅེས་རྣམ་པར་དཔྱོད་དེ།
en: What type of phenomenon does my mind engage with?’

source: གལ་ཏེ་དགེ་བ་ལ་སྤྱོད་ན་དེ་ལ་སེམས་དགའ་བ་དང་། རངས་པ་དང་། མོས་པ་སྐྱེད་དོ།
en: If they find that their mind is involved in virtue they will feel joy, appreciation, and inspiration.

source: དགེ་བའི་ཆོས་དེ་དག་ཀྱང་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནོ།
en: As for virtuous qualities, these consist of the thirty-seven factors of awakening.
